//请你判断一个 9 x 9 的数独是否有效。只需要 根据以下规则 ，验证已经填入的数字是否有效即可。 
//
// 
// 数字 1-9 在每一行只能出现一次。 
// 数字 1-9 在每一列只能出现一次。 
// 数字 1-9 在每一个以粗实线分隔的 3x3 宫内只能出现一次。（请参考示例图） 
// 
//
// 
//
// 注意： 
//
// 
// 一个有效的数独（部分已被填充）不一定是可解的。 
// 只需要根据以上规则，验证已经填入的数字是否有效即可。 
// 空白格用 '.' 表示。 
// 
//
// 
//
// 示例 1： 
// 
// 
//输入：board = 
//[["5","3",".",".","7",".",".",".","."]
//,["6",".",".","1","9","5",".",".","."]
//,[".","9","8",".",".",".",".","6","."]
//,["8",".",".",".","6",".",".",".","3"]
//,["4",".",".","8",".","3",".",".","1"]
//,["7",".",".",".","2",".",".",".","6"]
//,[".","6",".",".",".",".","2","8","."]
//,[".",".",".","4","1","9",".",".","5"]
//,[".",".",".",".","8",".",".","7","9"]]
//输出：true
// 
//
// 示例 2： 
//
// 
//输入：board = 
//[["8","3",".",".","7",".",".",".","."]
//,["6",".",".","1","9","5",".",".","."]
//,[".","9","8",".",".",".",".","6","."]
//,["8",".",".",".","6",".",".",".","3"]
//,["4",".",".","8",".","3",".",".","1"]
//,["7",".",".",".","2",".",".",".","6"]
//,[".","6",".",".",".",".","2","8","."]
//,[".",".",".","4","1","9",".",".","5"]
//,[".",".",".",".","8",".",".","7","9"]]
//输出：false
//解释：除了第一行的第一个数字从 5 改为 8 以外，空格内其他数字均与 示例1 相同。 但由于位于左上角的 3x3 宫内有两个 8 存在, 因此这个数独是无
//效的。 
//
// 
//
// 提示： 
//
// 
// board.length == 9 
// board[i].length == 9 
// board[i][j] 是一位数字（1-9）或者 '.' 
// 
//
// Related Topics 数组 哈希表 矩阵 👍 1274 👎 0


import java.util.HashSet;
import java.util.Set;

//leetcode submit region begin(Prohibit modification and deletion)
class Solution {
    public boolean isValidSudoku(char[][] board) {
        //存储原有数独的数值 选用set进行比对
        Set<Character> [] cols=new HashSet[9];
        Set<Character> [] rows=new HashSet[9];
        Set<Character>[][] box=new HashSet[3][3];

        //初始化
        for (int i = 0; i < 9; i++) {
            cols[i]=new HashSet<>();
            rows[i]=new HashSet<>();
            for (int j = 0; j < 3; j++) {
                box[i/3][j]=new HashSet<>();
            }
        }

        //遍历矩阵 判断是否存在重复值 不重复加入
        for (int i = 0; i < 9; i++) {
            for (int j = 0; j < 9; j++) {
                char num=board[i][j];

                //跳过空白格
                if (num=='.'){
                    continue;
                }

                //检查行
                if (cols[i].contains(num)){
                    return false;
                }
                cols[i].add(num);

                //检查列
                if (rows[j].contains(num)){
                    return false;
                }
                rows[j].add(num);

                int a=i/3;
                int b=j/3;
                if (box[a][b].contains(num)){
                    return false;
                }
                box[a][b].add(num);
            }
        }
        return true;
    }
}
//leetcode submit region end(Prohibit modification and deletion)
